cask_args appdir: "/Applications"

brew "awscli"
brew "cmake"
brew "curl"
brew "docker"
brew "fd"
brew "gh"
brew "git"
brew "hadolint"
brew "jordanbaird-ice"
brew "jq"
brew "make"
brew "mise"
brew "ripgrep"
brew "tree"
brew "usage"
brew "wget"
brew "zoxide"

cask "alt-tab"
cask "claude"
cask "cursor"
cask "drawio"
cask "ghostty"
cask "github"
cask "gitify"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "itsycal"
cask "logi-options+"
cask "notion"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "visual-studio-code"
cask "zed"
cask "zoom"